[{"coords":["-72.50731076369362","40.25"],"text":"The altar in Roque and Carmen Macias' living room in Whittier, California, set up after their son Oscar went missing in July 2014. The candle at the center is meant to light his way home."},{"coords":["-79.78488246072892","70.76229472881238"],"text":"The last time any of Oscar Macias' family or friends spoke with him was in this July 20, 2014, text exchange between Oscar and his best friend Tommy Cantu. They suspect the last few messages were sent by someone other than Oscar."},{"coords":["-68.74679323767967","70.77766492325978"],"text":"Described in federal court filings as a CJNG \"plaza boss,\" Jesus Enrique Palomera is the man federal authorities believe had Oscar Macias killed after Macias lost a shipment of meth bound for Tacoma, Washington. Palomera has not been charged with Oscar's death and has denied responsibility."},{"coords":["-85.25","134.5"],"text":"The U.S. is offering $10 million for help capturing \"El Mencho,\" a ruthless cartel leader blamed for pumping huge amounts of deadly drugs into America."},{"coords":["-90.25","127"],"text":"El Mencho's cartel, called CJNG, has more than 5,000 members who are armed with military-grade weapons."},{"coords":["-89.125","164"],"text":"U.S. officials have sanctioned more than 60 businesses tied to CJNG, including a luxe oceanside Mexican resort, a shopping mall, casinos and even a medical center."},{"coords":["-111.25","169.25"],"text":"CJNG and another cartel laundered $101 million in drug money in Florida and California by buying gold with drug profits."},{"coords":["-184.5","214"],"text":"In Paducah, Kentucky, known for the National Quilt Museum, CJNG sold meth and also tried to buy grenades."},{"coords":["-185.8194580078125","224.2139892578125"],"text":"A CJNG member texted a Paducah businessman these photos of a meth super lab in Mexico to show proof that the drugs would soon be ready for Kentucky."},{"coords":["-186.75","193.58805227131302"],"text":"In Louisville — home to the Kentucky Derby — CJNG ran a drug ring through a used tire store that rarely worked on a car. SWAT members crept toward the home of the drug ring leader and blew the door off its hinges. He's now in prison."},{"coords":["-172.75","157.31549471064096"],"text":"Ciro Macias Martinez, who sneaked into the U.S. as a teen, headed a Kentucky drug cell for CJNG during the night. During the day, he groomed horses at historic Calumet Farm — which has produced Derby and Triple Crown winners. The farm wasn't invovled in any crimes."},{"coords":["-193","164.06969508400746"],"text":"Ciro Macias Martinez, the Kentucky drug cell leader, pumped in $30 million worth of dangerous drugs into Kentucky. But he and his family lived in a modest trailer."},{"coords":["-184","153.0628500311139"],"text":"Ciro Macias Martinez's wife, Brizeida Janett Sosa, oversaw a money laundering scam that sent more than $1 million to cartel members in Mexico through bank deposits in Nashville, Tennessee; Lexington, Kentucky and Greensboro, North Carolina. Sosa, pregnant at the time, was incensed when a bank manager accused her, a waitress, of being a terrorist."},{"coords":["-190.1875","82.1875"],"text":"Silvia Morán has been looking for her missing son for two years. She goes to the morgue to look at photos of body parts to see if any of them have tattoos that match her son's."},{"coords":["-187.75","35.125"],"text":"Silvia Morán, whose son has been missing for two years, regularly shares messages on social media about her search for him: \"I share my son's picture every day. When I have time, I write something different every day. Sometimes I write, 'I keep looking for you, son.' Or my slogan: 'I promised not to die until I found you.'\""},{"coords":["-170.25","104.75"],"text":"Jason Gazzo, a third-generation Mississippi state trooper, nearly helped capture El Mencho, an elusive billionaire cartel leader he'd never even heard of."},{"coords":["-172.75","118.75"],"text":"Gulfport is a small beach town off Interstate 10, a major drug corridor that runs from Mexico all the way to Alabama. CJNG members weren't worried about its lawmen, whom they called \"Barney Fife deputies\" -- until they were in handcuffs."},{"coords":["-184.75","127.5"],"text":"A DEA task force in Mississippi tracked down CJNG leader El Mencho in 2012 -- leading Mexican police to raid a cartel compound. Four CJNG members were killed in a shootout with police, but El Mencho ran out the back and escaped."},{"coords":["-184.5","98.5"],"text":"This petite, blond doesn't look like a typical cartel boss, but she headed a West Coast drug cell and planned to start a drug cell in Mobile, Alabama. She had a romance with the married El Mencho, who sent her $1 million in meth to sell on the Gulf Coast. "},{"coords":["-163.23936418083213","58.18955959716996"],"text":"13 Mexican policemen were massacred in October in the western state of Michoacán in an ambush blamed on CJNG."},{"coords":["-172.625","21.75"],"text":"Some U.S. drug agents have called Mexican investigators among the bravest police in the world, daily facing incredible danger fighting cartels."},{"coords":["-134.375","46.25"],"text":"CJNG members uses a tactic called \"narco blockades\" to snarl traffic, cause chaos and hinder police efforts to capture their leader. They force drivers out of trucks, buses and semis at gunpoint and then set the vehicles on fire. They also blow up banks and gas stations."},{"coords":["-137.875","71.5"],"text":"CJNG shot down a military helicopter, sending it crashing into trees in 2015 -- the year of its violent power grab. Several soldiers and a federal police officer were killed."},{"coords":["-148.875","55.25"],"text":"Ivan Morales, a Mexican federal police officer, is disfigured and unable to resume the police work he loved after CJNG shot his helicopter out of the sky with a grenade launcher."},{"coords":["-88.25","90.75"],"text":"Menchito, the son of cartel leader El Mencho, was the second-in-command of CJNG. But he is now in a Mexican jail awaiting extradition to the U.S. He had a bandage from a nose job. Officials didn't know if it was an attempt to disguise his identity."},{"coords":["-75.75","107"],"text":"El Mencho sneaked into the U.S. at least three times as a teen and young adult, trying to sell drugs. He is now age 53."},{"coords":["-120.5","52.75"],"text":"CJNG illegally buys some of its assault rifles and other weapons from the U.S."},{"coords":["-100.5","146"],"text":"CJNG spreads fear by posting on social media photos and videos of kidnappings, torture and murder. That includes bodies hanging from public overpasses, heads lined up in a row and mass graves."},{"coords":["-66.36021362747141","185.25"],"text":"Three sisters from Winchester, Virginia, including Judith Wright, left, and Vicky Houghton, right, were among those authorities allege were caught up in a drug trafficking case connected to the CJNG drug cartel."},{"coords":["-81.76052138778628","202.00000190734863"],"text":"In Winchester, Virginia, a town of about 28,000, prosecutors say resident Blas Rodriguez-Avila formerly lived on Smithfield Avenue and trafficked in drugs connected to the CJNG cartel. New residents not connected with the case have since moved in."},{"coords":["-98.97895436548077","192.25"],"text":"A general scene around Axton, Virginia. In March of 2019, authorities announced indictments in a case alleging that the CJNG cartel sent people to live in Axton to help traffic drugs to Virginia towns and nearby states."},{"coords":["-127.97251367560635","214.125"],"text":"Part of a property in Axton, Virginia, that was identified in court papers as being formerly related to an investigation of a cartel drug case."},{"coords":["-152.78125","189.75"],"text":"Lisa Dawn Wentworth ran a \"redneck\" meth empire out of Lenoir, North Carolina, with her then-boyfriend Roger Dale Franklin until they were busted in 2014."},{"coords":["-142.96875","211.625"],"text":"Martin Martinez Saldana was a Mexican-American connected to CJNG who is serving a life sentence in federal prison for trafficking at least 20 pounds of methamphetamines into the region."},{"coords":["-140.96875","221.6875"],"text":"At least 266 people have been convicted as a part of Operation Dixie Crystal, a joint local, state and federal task force aimed at dismantling organized drug trafficking in the Western District of North Carolina."},{"coords":["-103.86457359790802","207.20832753181458"],"text":"A general scene around Axton, Virginia. In March of 2019, authorities announced indictments in a case alleging that the CJNG cartel sent people to live in Axton to help traffic drugs to Virginia towns and nearby states."},{"coords":["-99.45832359790802","219.30207753181458"],"text":"A general scene around Axton, Virginia. In March of 2019, authorities announced indictments in a case alleging that the CJNG cartel sent people to live in Axton to help traffic drugs to Virginia towns and nearby states. The structure pictured wasn't connected to the case."},{"coords":["-114.69790852069855","213.61457657814026"],"text":"Part of a property in Axton, Virginia, that was identified in court papers as being formerly related to an investigation of a cartel drug case."},{"coords":["-117.625","199.6875"],"text":"Part of a property in Axton, Virginia, that was identified in court papers as being formerly related to an investigation of a cartel drug case."},{"coords":["-79.88540661334991","220.8958237171173"],"text":"A general scene of the streets of Winchester, Virginia."},{"coords":["-128","195"],"text":"Part of a property in Axton, Virginia, that was identified in court papers as being formerly related to an investigation of a cartel drug case."}]